{
  "latest": "ORSC-5.5.2",
  "notes": [
    {
      "title": "ORSC-5.5.2",
      "date": "2020-11-01",
      "changes": [
        {
          "type": "Bug Fixes",
          "details": [
            "Tweaked accuracy bonus for lower level range items. Should be more forgiving.",
            "Fixed an issue where XP drops weren't always showing on RSC Cabbage",
            "Fixed poison to support wilderness poison PKing",
            "Tweaked agility to be more strict after a certain point",
            "Fixed \"Bury All\" batching to not include noted bones in the total count of bones to bury,",
            "Corrected the dragon slayer quest complete text",
            "Fixed Melzar's Maze escape doors",
            "Fixed the Charge spell. It was implemented backwards.",
            "Fixed poisoning to be more authentic",
            "Added a \"Nothing interesting happens\" message when you try to use a noted item on a scenery object",
            "Corrected the Thessalia NPC to work with scythes and bunny ears authentically",
            "Changed herbs from muddy to undefined",
            "Fixed an issue where Chaos Druids weren't dropping two herbs",
            "Removed raw rat meat from the Witch's Potion rats' drop table",
            "Players should no longer be blocked from speaking to one of the NPCs if they are standing outside of the store",
            "Corrected admin command for spawning multiple items to players"
          ]
        },
        {
          "type": "RSC235 Compatibility",
          "details": [
            "Added a method detect bad incoming data and re-sync ISAAC",
            "Added a \"stayin\" command for mods that will keep mods from being auto logged out while on an authentic client",
            "Trying to talk on tutorial island will no longer crash authentic clients",
            "Fixed handling of doors and webs",
            "Fixed the length of opcode 111c"
          ]
        },
        {
          "type": "Enhancements",
          "details": [
            "Changed the ::tp command so that you no longer appear right on top of the player you are teleporting to",
            "The \"Dropping X/Y\" message will no longer show on servers without batching or when dropping a stack",
            "Updated the Halloween cracker to include the pestilence and fox masks",
            "Added an admin command to perform Halloween world drops supporting scythes and Halloween crackers as well as updated command documentation",
            "Added the ability to completely opt out of Global friend feature"
          ]
        },
        {
          "type": "Core Framework",
          "details": [
            "Added a QoL opt-out feature so that players can chose to disable quality of life features and play more authentically"
          ]
        }
      ]
    },
    {
      "title": "ORSC-5.5.1",
      "date": "2020-10-22",
      "changes": [
        {
          "type": "Bug Fixes",
          "details": [
            "Fixes the logout timer so that you can no longer be stuck in combat indefinitely. Players should always be logged about by the 5 (or 10 if on Cabbage) minute movement timer no matter what.",
            "Updated the Entrana item list to be more accurate to original RSC",
            "Tightened up some NPC and item spawns",
            "Fixed Witch's House",
            "Fixed up timing and packet order on thieving",
            "Fixed up timing on mining",
            "Retreat sound effect now plays when you run away from an NPC",
            "Fixes an issue where dying to \"nothing\" would cause you to enter a zombie state",
            "Players can now cook Ugthanki meat"
          ]
        },
        {
          "type": "RSC235 Compatibility",
          "details": [
            "Began utilizing the sendExperience opcode instead of only the sendStat one."
          ]
        },
        {
          "type": "Enhancements",
          "details": [
            "Added a button for Items Kept on Death (can be found in the equipment screen) and removed the text button from the settings menu",
            "Restored the \"Dropping x/y\" message that was removed forever ago. This will show when you click \"Drop All\" or \"Drop X.\"",
            "Added \"Arrow Shafts\" tab to the fletching skill guide and added how many shafts you get when fletching a type of log. Also added the name of each skill cape to the guide (instead of just \"Cape\") and fixed a typo in the Thieving guide.",
            "Brimhaven cart can only be ridden if you complete Shilo Village"
          ]
        }
      ]
    },
    {
      "title": "ORSC-5.5.0",
      "date": "2020-10-06",
      "changes": [
        {
          "type": "RSC235 Compatibility",
          "details": [
            "The OpenRSC server is now compatible with the RSC235 protocol, meaning that you can now use RSC+ to connect and play! (Thanks, Logg!) The Cabbage world is custom, and therefore not currently supported."
          ]
        },
        {
          "type": "Android Client Updates",
          "details": [
            "When an update is needed, the app will now redirect you to the website to download the new APK instead of trying to update itself.",
            "The ::wiki command will now work on mobile! For example, if you type \"::wiki rune pickaxe\" in the chat, the Rune pickaxe wiki page will open in your default browser.",
            "The side menu on Cabbage will now disappear when you open the keyboard and reappear when you close it (if you had it showing in the first place).",
            "On phones that allow it, the navigation bar will now be hidden until you swipe from the side to reveal it. (This is an experimental feature, let us know if you encounter any bugs with it.)"
          ]
        },
        {
          "type": "Bug Fixes",
          "details": [
            "Removed the trade option from Shantay Pass guards",
            "Fixed an inauthentic timing on flax spinning",
            "Players can now teleport while ranging",
            "Fixed a bug where you could only uncert from your inventory in the bank UI once per client lifetime",
            "Fixed an issue where the Withdraw options would always show on the authentic bank menu, even if there was nothing in the bank to withdraw.",
            "Fixed some peculiar mage arena behavior",
            "Fixed an issue where you could use noted tools while harvesting or fishing",
            "Fixed an issue where your client would crash if you tried to add a friend with a name that begins with the \"-\" or \"_\" characters",
            "Runecraft skillguide now shows correct level requirements for cursed and enfeebled talismans",
            "Removed a duplicate item spawn in a house in Brimhaven"
          ]
        },
        {
          "type": "Enhancements",
          "details": [
            "The bank limit has been increased to 240 items on Cabbage.",
            "The apothecary will now empty potion vials or fill empty vials with water. Either service costs 50 gp per vial, and works on noted potions/vials.",
            "You can now provide an argument to the ::kills command to show how many kills you have on a specific NPC (e.g. \"::kills King Black Dragon\"). The formatting of the original menu has also been changed to look nicer.",
            "Pretty much every edible/drinkable item that heals you has been added to the Hits skillguide."
          ]
        }
      ]
    },
    {
      "title": "ORSC-5.4.8",
      "date": "2020-08-29",
      "changes": [
        {
          "type": "Bug Fixes",
          "details": [
            "Ring of Wealth message no longer triggers on a \"nothing\" drop.",
            "Clicking the \"new captcha\" button while sleeping now works properly on all screen sizes and mobile.",
            "Added base prices to all custom tradable items (this fixes a dupe glitch that was occurring within shops).",
            "Cursed and enfeebled talismans are no longer tradeable.",
            "Made some small tweaks to leather armor.",
            "Level up achievements will now be logged at level 80 and above for 1x accounts/worlds. These levels ups will show on the website homepage."
          ]
        },
        {
          "type": "Enhancements",
          "details": [
            "Added new chainmail legs for all metal tiers. Boots can be worn while wearing chain legs."
          ]
        },
        {
          "type": "Core Improvements",
          "details": [
            "Reverted the mod command structure to re-enable aliases."
          ]
        }
      ]
    },
    {
      "title": "ORSC-5.4.4",
      "date": "2020-07-28",
      "changes": [
        {
          "type": "Bug Fixes",
          "details": [
            "Force players to log out when a ping timeout occurs, after 30 seconds (players should no longer get stuck online when this occurs).",
            "Ring of Wealth has been adjusted. It now will provide an extra roll when you initially roll 'nothing'. It no longer removes all empty drops.",
            "Agility failure rates on the Barbarian and Wilderness courses have been adjusted to fail less frequently based on data from replays.",
            "Allow magic to be cast while in combat with enemies that are normally not attackable (ex: Shapeshifter).",
            "Gold drops now use the proper code, and will drop accurately.",
            "Add Rare Drop Table to Shadow Warrior NPCs.",
            "Shops now allow purchasing of non-stacked items up to the full inventory.",
            "New characters are now created with 1000 hp.",
            "The Fishing Guild shop is now a specialty shop, as it was authentically.",
            "Add pipe and forward slash to permitted chat characters.",
            "Force minimum client size to authentic constraints.",
            "Fix message on gnome gliders when attempting to 'fly' them.",
            "Skeleton NPCs around the wilderness agility course have been replicated with the correct count.",
            "Fixed an issue where NPCs that shouldn't chase you were chasing."
          ]
        },
        {
          "type": "Core Improvements",
          "details": [
            "Rate limiting on packets has been adjusted to 50 packets per second.",
            "Added a configurable option to allow/disallow players to create characters with 'mod' in the name. This is toggled to disallow by default.",
            "Added a command for Super Mods and Admins to change the name of characters. The target character must be logged out. Note that changing a character's name may affect things on the website and other players' friendslists."
          ]
        }
      ]
    },
    {
      "title": "ORSC-5.4.3",
      "date": "2020-07-19",
      "changes": [
        {
          "type": "Bug Fixes",
          "details": [
            "Spells can now hit a 0.",
            "Players can now use magic against all the shapeshifter forms while in combat with it during Witch's House.",
            "Shadow Warriors now drop more than just their bones.",
            "Rare and Ultra Rare Drop Table rates have been slightly tweaked.",
            "Blue wizards now drop the correct wizard hat",
            "Player moderators are now visible to normal players in the online list."
          ]
        },
        {
          "type": "Core Improvements",
          "details": [
            "Reorganized the plugin folder hierarchy.",
            "Rewrote the command infrastructure."
          ]
        }
      ]
    },
    {
      "title": "ORSC-5.4.2",
      "date": "2020-07-15",
      "changes": [
        {
          "type": "Bug Fixes",
          "details": [
            "Players can now swap weapons while in all types of combat",
            "Fixed a plugin crash caused by clicking away from Mum",
            "Fixed a crash with NPC retreats when the opponent has been removed",
            "Fixed a crash when clicking the Forgot Password button",
            "Fixed an issue where hobgoblins weren't dropping limpwurt roots",
            "Fixed a bug where the guard wouldn't catch people who were stealing cakes",
            "Replaced missing custom scenery/objects that were lost in the migration to JSON",
            "Quest NPCs that have death conditions (Count Draynor, Delrith, ect.) are now able to be killed properly",
            "Added a check for a null script context, fixes some plugins crashing.",
            "Fixed Gnome waiter menu options (trade/pickpocket)",
            "Removed King Lathas trade option",
            "Fixed a bug where the auction house couldn't be refreshed by some",
            "Fixed an issue where players couldn't swap weapons while in combat.",
            "Fixed an issue where you had to wait a long time in between attempting to cut the webs in the Wilderness",
            "Fixed an issue where stat draining NPCs would cause an infinite loop (specifically Kolodion and Salarin)"
          ]
        },
        {
          "type": "Enhancements",
          "details": [
            "Fishing spots now have a lower chance to turn into a pebble",
            "Teddy parts must be brought to the child before you can stitch them",
            "Can no longer get stuck behind lockpick doors if fatigued.",
            "Ensure all players show in the count when doing ::online regardless of privacy setting",
            "Removed some naughty words from the sleep words list"
          ]
        },
        {
          "type": "Core Improvements",
          "details": [
            "Synchronized game objects to ensure they cannot be accessed by multiple threads at once",
            "Batching now checks your position to make sure you haven't moved during the batch (special checks for Firemaking also)",
            "Plugins are now interrupted on trade initiation.",
            "Changed the location where the 'helped_femi' cache key is removed",
            "Removed jsoup as it was causing anti-virus programs to flag the launcher.",
            "Removed an unneeded attribute from Demon Slayer"
          ]
        }
      ]
    },
    {
      "title": "ORSC-5.4.1",
      "date": "2020-06-30",
      "changes": [
        {
          "type": "Features",
          "details": [
            "Re-enable the auction house. Happy trading!",
            "A relative of yours is looking for you in Lumbridge! (Custom content miniquest has been released)"
          ]
        },
        {
          "type": "Bug Fixes",
          "details": [
            "Players can now load multiple clients without the ports becoming broken for the previously loaded client.",
            "Logging out with ::mod or ::dev active will now disable the commands.",
            "Fix a problem with Balrog drops.",
            "Players can no longer trade while in combat.",
            "Fix a client crash when buying or selling X to the store.",
            "Ensure players do not sell or buy 0.",
            "Correct the behaviour of the bank vault gate.",
            "Respawning NPCs now always face north.",
            "The game will now message you if you attempt to pick up an item while in combat.",
            "Preset loading now occurs more rapidly."
          ]
        },
        {
          "type": "Enhancements",
          "details": [
            "The auction house now requires a minimum of 100 skill total to use.",
            "The auction house now has rate limits to avoid complications with exchanging items.",
            "Users may not log out for 5 seconds after performing an auction interaction.",
            "Limit packet spam to a subset of all packets.",
            "Add additional safety checks to various packet handlers.",
            "Adjust some of the NPC definitions to have more consistent organization.",
            "Abstract object definitions to JSON format."
          ]
        }
      ]
    },
    {
      "title": "ORSC-5.4.0",
      "date": "2020-06-24",
      "changes": [
        {
          "type": "Bug Fixes",
          "details": [
            "Authentic cooking now has 1 less tick to cook items.",
            "When talking to NPCs, they will now only face you if they want to talk to you.",
            "Staff commands now work from the online list.",
            "Fix a bug where an exception occurred on the server when discord auction updates were disabled.",
            "Fix issues with shop quantities when buying and selling items.",
            "Ensure staff see proper locations when using ::onlinelist.",
            "Ensure the player is teleported properly when caught by guards during the Tourist Trap quest.",
            "Trufitus no longer says \"Well, just let me see the item and I'll help as much as I can.\" twice.",
            "Find ceril properly after being teleported upstairs during the Hazeel Cult quest.",
            "Ensure when we try to find an npc, if they are busy, we don't crash.",
            "As per authentic play, when fatigued a pickaxe now shows above the players head.",
            "Add two pieces of food to the \"never burn\" list.",
            "Ensure that after Scorpion Catcher the Seer does not say \"Many greetings\" to the player.",
            "Attempt to fix a thread deadlock in combat."
          ]
        },
        {
          "type": "Enhancements",
          "details": [
            "Core delay function now uses tick timing instead of milliseconds to calculate thread pause.",
            "Core mes function no longer calls delay.",
            "Ensure game events are run prior to updating packets to send to the client.",
            "Ground item locations and npc locations are now stored in JSON on the server, instead of within the database.",
            "Use UUID object for the player's unique ID instead of a string.",
            "Ensure when auction house is disabled it is impossible to send auction house commands to the server."
          ]
        },
        {
          "type": "Known Bugs",
          "details": [
            "We are working on a fix for a bug found when using 3rd party tools to interact at inhuman speeds with the auction house."
          ]
        }
      ]
    },
    {
      "title": "ORSC-5.3.0",
      "date": "2020-06-19",
      "changes": [
        {
          "type": "Features",
          "details": [
            "Runecraft has been updated to allow casting curse and enfeeble on existing talismans! When casting curse on a talisman, you will gain 2x experience from crafting runes and the talisman will crumble. When casting enfeeble on a talisman, you will gain 5x experience from crafting runes, and the talisman will explode dealing damage to you and causing your current runecraft stat to deplete.",
            "Fish may now be ground using a pestle and mortar to create a stackable item, Fish Oil! This oil can be used to create Runecraft potions (useful for restoring your lost runecraft from enfeebled talismans), and can also be eaten. Two Runecraft potions are available, by using marrentil or by using avantoe as a base. When fish oil is eaten, it will provide a 50% chance of healing 1 hits. Different fish will provide different quantities of fish oil. Only certain fish may be ground, so be sure to experiment and see which reward fish oil."
          ]
        },
        {
          "type": "Bug Fixes",
          "details": [
            "Goblin Guards now drop big bones instead of normal bones.",
            "Shantay's chest object no longer shows the shantay message on variants outside of Al Kharid.",
            "The ::onlinelist command now properly shows other players for staff.",
            "Auditing of many more quest-specific mob locations, timers, and behaviour.",
            "Regular wool may now be used to entertain cats.",
            "Tasty kebab now has a thinkbubble associated with eating it.",
            "Mobs are now killed only once when attacked with specific circumstances.",
            "Fix some dialog bugs introduced with the recent major audits.",
            "Shops now handle buying and selling more efficiently, and provide the correct coin for items.",
            "Shops now stock a maximum of 65535 of one item stack.",
            "Plugins now only load once per class, ensuring bugs like double-shop are squashed.",
            "Fix a bug that made the JSON library complain on computers running JDK 8."
          ]
        },
        {
          "type": "Enhancements",
          "details": [
            "Fishing spots now deplete more frequently, but also respawn at a quicker rate.",
            "Repeat times are now adjusted to a more reasonable count.",
            "The ::onlinelist command now shows readable locations for staff.",
            "Rune essence is now renamed to Rune stone through the code.",
            "Unidentified herbs now have unique sprites.",
            "Soft clay making is now batched.",
            "Lockpicking doors will now batch until successful.",
            "Skill guides now display additional details for harvested food and Runecraft talismans."
          ]
        }
      ]
    }
  ]
}